---
kind: type
id: T:Autodesk.Revit.DB.UVGridlineType
source: html/df2bed21-2c63-f165-27be-8004ea2f7ad0.htm
---
# Autodesk.Revit.DB.UVGridlineType

A choice between U-gridlines or V-gridlines of a divided surface
 U Gridlines
 V Gridlines

## Syntax (C#)
```csharp
public enum UVGridlineType
```